%4-1(1)

N = 6;%周期
n = 0:N-1;
x = [1, 1, 1, 1, 0, 0];%值
a = fft(x) / N;%傅里叶级数
mag_a = abs(a);%模
phase_a = angle(a);%相位

fprintf('傅里叶级数\n');
for k = 0:N-1
    fprintf('a_%d = %.4f + j%.4f\n', k, real(a(k+1)), imag(a(k+1)));
end

fprintf('模|a_k|\n');
for k = 0:N-1
    fprintf('|a_%d| = %.4f\n', k, mag_a(k+1));
end

fprintf('相位∠a_k\n');
for k = 0:N-1
    fprintf('∠a_%d = %.4f\n', k, phase_a(k+1));
end

%输出结果
%傅里叶级数
%a_0 = 0.6667 + j0.0000
%a_1 = 0.0000 + j-0.2887
%a_2 = 0.1667 + j0.0000
%a_3 = 0.0000 + j0.0000
%a_4 = 0.1667 + j0.0000
%a_5 = 0.0000 + j0.2887
%模|a_k|
%|a_0| = 0.6667
%|a_1| = 0.2887
%|a_2| = 0.1667
%|a_3| = 0.0000
%|a_4| = 0.1667
%|a_5| = 0.2887
%相位∠a_k
%∠a_0 = 0.0000
%∠a_1 = -1.5708
%∠a_2 = 0.0000
%∠a_3 = 0.0000
%∠a_4 = 0.0000
%∠a_5 = 1.5708